In [1]:
import numpy as np
import pandas as pd

In [6]:
dict= {"name":['Amit', 'Ankit', 'Srija', 'Vaishnavi'],
      "marks":[84, 80, 78, 76],
      "city":['varansi', 'indore', 'vijayvada', 'chindwada']
      }

In [7]:
df = pd.DataFrame(dict)

In [8]:
df

        name  marks       city
0       Amit     84    varansi
1      Ankit     80     indore
2      Srija     78  vijayvada
3  Vaishnavi     76  chindwada

In [9]:
df.to_csv('Marks.csv')